`Sage <http://www.sagemath.org>`_ 是一个免费的、开源的数学软件系统，采用 GPL 开源协议发布。它整合了
许多开源 `Python <http://www.python.org>`_ 包，并采用 Python 语言编写，但也支持其他语言。它的目标是创
造一个强大的开源数学软件，以作为 Magma、Maple、Mathematica 和 Matlab 等商业数学软件的优秀开源解决方案。Sage 不仅
是一个软件，同时也是一个编程环境，它提供命令行模式和笔记本模式，可以编写编译型程序和解释型程序。Sage 是目前功能
最强大，集成度最高的开源数学软件，正是因为如此，才诞生两年的 Sage 就赢得自由软件的国际竞争中科学软件部分的 Les
Trophées du Libre 首奖。更多关于 Sage 的介绍可以从官方文档中获得。

本文档的英文版本由 Sage 开发组编写，属于官方文档的一部分，国内也有爱好者翻译过早期版本，但排版不是很好，也有少
许细节不太清楚，故利用业余时间重新翻译并用 LaTeX 进行重新排版，并加入了自己的一些见解。因为本文档很简短，所
以，本文档在与官方保持更新的同时，我还会逐渐加入自己在学习 Sage 过程中的个人经验，希望能把该文档写成一个入门级
的教程，并随官方文档一起发布。更希望读者对本文档提出宝贵的意见和建议，使该文档成为 Sage 初学者的首选教程。

最后需要声明的是，本文档遵循\ `Creative Commons Attribution-Share Alike 3.0 License <http://creativecommons.org/licenses/by-sa/3.0/>`_
发布，您可以复制、传播并
加以修改，详情请阅读相关内容。

创建 Sage 学习环境
==================

学习 Sage 要做的第一件事，就是要创建 Sage 学习环境。:ref:`本章 <section-installation>` 将详细介绍如何进行 Sage 学习环境的创建，但不包括从
源码编译 Sage 方面的内容，因为这对于初学者是一个比较棘手的事情，即使从源码编译也并不是一件很难的事情。


把 Sage 用作计算器
==================

Sage 的命令行带有 \ ``sage:``\ 提示符，你并不需要手动进行添加。如果你使用的是 Sage
notebook，那么
将 \ ``sage:``\ 提示符后的全部代码输入一个空的单元，然后按下 \ ``Shift+Enter``\ 来得到输出。

基本四则运算
------------

::

    sage: 3 + 5
    8

幂运算
------

符号\ ``“^”``\ 表示指数：

::

    sage: 57.1^100      # 表示57.1的100次方
    4.60904368661396e175

矩阵运算
--------

在 Sage 中计算一个 \ :math:`2\times2` 矩阵的逆：

::

    sage: matrix([[1,2], [3,4]])^(-1)
    [  -2    1]
    [ 3/2 -1/2]

积分运算
--------

下面我们对一个简单函数进行积分：

::

    sage: x = var('x')   # 创建一个符号变量
    sage: integrate(sqrt(x)*sqrt(1+x),x)
    1/4*((x + 1)^(3/2)/x^(3/2) + sqrt(x + 1)/sqrt(x))/((x + 1)^2/x^2
    - 2*(x + 1)/x + 1) - 1/8*log(sqrt(x + 1)/sqrt(x) + 1)
    + 1/8*log(sqrt(x + 1)/sqrt(x) - 1)


解方程
------

下面用 Sage 求解二次方程，需要说明的是，在 sage 中，\ ``==`` 代表相等。

::

    sage: a = var('a')
    sage: S = solve(x^2 + x == a, x); S
    [x == -1/2*sqrt(4*a + 1) - 1/2, x == 1/2*sqrt(4*a + 1) - 1/2]

上面的结果是一个等式列表。

::

    sage: a = var('a')
    sage: S = solve(x^2 + x == a, x)
    sage: S[0].rhs()        # S[0]代表上例结果中的第一个等式 而函数rhs()返回等式右边的内容
    -1/2*sqrt(4*a + 1) - 1/2

数据可视化
==========

Sage 具有强大的数据可视化功能，能够绘制精美的二维图形及三维图形，并具有交互功能，这是某些商业数学软件都难以达到的水平。

二维绘图
--------

Sage 具有广泛的二维图形绘制函数，既能绘制单个函数图像，也能多图同时绘制，还能在图像任意位置处添加文字或公式。

单个函数图像
~~~~~~~~~~~~

::

    sage: show(plot(sin(x) + sin(1.6*x), (x,0,40), plot_points = 500))

.. image:: sin_plot.*

多个函数图像
~~~~~~~~~~~~

::

    sage: show(sum(circle((i,0), i, hue=sin(i/10)) for i in \
    ....:     [100,99.5,..,0]), aspect_ratio=1,figsize=10)

.. image:: circles_plot.*

三维绘图
--------

Sage 的三维绘图功能也非常强大，而且提供众多控件。

::

    sage: var('x y')
    (x, y)
    sage: plot3d(sin(x^2 + y^2)/(x^2 + y^2), (x,-3,3), (y,-3,3),
    ....:        plot_points=150, color='green')
    Graphics3d Object

.. image:: plot_3d.*

交互
----

Sage 的交互函数能进行实时交互。

.. skip

::

    sage: @interact
    ....: def _(a=(1,4), b=(0,10)):
    ....:     show(plot(sin(a*x+b)^2+a*cos(a*x^2), (x,0,6)), figsize=[8.5,3.5])

.. image:: interact_screenshot.*

注意：Sage 的编程语言是 Python，而在 Python 中，空格是具有实际意义的，也就是
说空格在 Sage 中具有实际意义，不能随意进行删减。当不能一行输入完程序时，那么在你
输完一行程序并按下 \ ``Shift+Enter`` 后，光标会自动缩进（比如上例），这时不要改变光标
的位置，直接进行下行的输入。

Sage 强大的数据处理能力
=======================

处理高阶矩阵
------------

首先，我们来创建一个 \ :math:`500\times500` 的随机矩阵：

::

    sage: m = random_matrix(RDF,500)

计算这个矩阵的本征值并将其绘出会花费Sage好几秒的时间。

::

    sage: m = random_matrix(RDF,500)
    sage: e = m.eigenvalues()     # 大约2秒
    sage: w = [(i, abs(e[i])) for i in range(len(e))]
    sage: show(points(w))

.. image:: eigen_plot.*

你所得到的本征值在你所绘制的图形上的分布跟上图很可能不一样，因为生成的矩阵
是随机，具有不确定性。

处理大型数字
------------

得益于 GNU多精度库（GNU Multiprecision
Library，简称：GMP），Sage 能够处理
非常大的数字，即使是成千上万位的数字。

::

    sage: factorial(100)           # 结果太长，不在此显示
    93326215443944152681699238856266700490715968264381621468592963895217599993229915608941463976156518286253697920827223758251185210916864000000000000000000000000

::

    sage: n = factorial(1000000)   # 大约2.5秒

输出精度达到 100 位有效数字的 \ :math:`\pi` 值：

::

    sage: N(pi,digits = 100)       # 结果太长，不在此显示
    3.141592653589793238462643383279502884197169399375105820974944592307816406286208998628034825342117068

处理多项式
----------

下面让 Sage 分解含有两个变量的高阶多项式：

::

    sage: R.<x,y> = QQ[]
    sage: F = factor(x^99 + y^99)
    sage: F
    (x + y) * (x^2 - x*y + y^2) * (x^6 - x^3*y^3 + y^6) * (x^10 - x^9*y +
    x^8*y^2 - x^7*y^3 + x^6*y^4 - x^5*y^5 + x^4*y^6 - x^3*y^7 + x^2*y^8 -
    x*y^9 + y^10) * (x^20 + x^19*y - x^17*y^3 - x^16*y^4 + x^14*y^6 +
    x^13*y^7 - x^11*y^9 - x^10*y^10 - x^9*y^11 + x^7*y^13 + x^6*y^14 -
    x^4*y^16 - x^3*y^17 + x*y^19 + y^20) * (x^60 + x^57*y^3 - x^51*y^9 -
    x^48*y^12 + x^42*y^18 + x^39*y^21 - x^33*y^27 - x^30*y^30 - x^27*y^33 +
    x^21*y^39 + x^18*y^42 - x^12*y^48 - x^9*y^51 + x^3*y^57 + y^60)

再将其展开：

::

    sage: R.<x,y> = QQ[]
    sage: F = factor(x^99 + y^99)
    sage: F.expand()
    x^99 + y^99

Sage 仅用不到 5 秒的时间就能计算出一千万分割成多个整数之和的方法总数：

::

    sage: z = Partitions(10^8).cardinality()    # 大约4.5秒
    sage: str(z)[:40]
    '1760517045946249141360373894679135204009'

版本说明
========

2012/02/18
      V4.8，删除原著第三章：从 sage 中获取算法，并加入第二章：数据可视化。

2012/02/23
      V4.8，根据官方发现的错误进行了修改，计划加入 Sage 安装指南。

2012/02/25
      V5.0，新建第一章：创建 Sage 学习环境，并在第二章中加入了微分运算。

2012/03/31
      V5.0，完成第一章：创建 Sage 学习环境，计划将本文档转化成 rst 格式。


.. toctree::
   :hidden:

   installation
